schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
static inline void ledWrite(uint8_t r, uint8_t g, uint8_t b) {
#if LED_IS_NEOPIXEL
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    rgbLedWrite(LED_PIN, r, g, b);
  #else
    neopixelWrite(LED_PIN, r, g, b);
  #endif
#else
    // Dual-GPIO and no-LED boards: updateLed() drives the pins directly (dual)
    // or there's nothing to drive (none).
    (void)r; (void)g; (void)b;
#endif
}

void updateLed() {
#if LED_IS_DUAL_GPIO
    uint32_t now = millis();

    // Yellow warning channel. Off when healthy; periods chosen so the two
    // failure modes are distinguishable at a glance.
    uint32_t warn_period_ms = 0;
    if (!g_can_initialized) {
        warn_period_ms = WARN_BLINK_FAST_MS;
#if !defined(NO_WIFI)
    } else if (!g_ap_running && WiFi.status() != WL_CONNECTED) {
        warn_period_ms = WARN_BLINK_SLOW_MS;
#endif
    }
    static uint32_t warn_last_toggle = 0;
    static bool     warn_on = false;
    if (warn_period_ms > 0) {
        if (now - warn_last_toggle >= warn_period_ms) {
            warn_last_toggle = now;
            warn_on = !warn_on;
        }
        digitalWrite(WARN_LED_PIN, warn_on ? HIGH : LOW);
    } else {
        digitalWrite(WARN_LED_PIN, LOW);
        warn_on = false;
    }

    // Blue activity channel. The board's green power LED already signals
    // "alive", so blue stays off until bus traffic appears.
    bool active = (g_frames_rx > 0) && (now - g_last_frame_ms < LED_ACTIVE_MS);
    static uint32_t act_last_toggle = 0;
    static bool     act_on = false;
    if (active) {
        if (now - act_last_toggle >= LED_BLINK_MS) {
            act_last_toggle = now;
            act_on = !act_on;
        }
        digitalWrite(ACTIVITY_LED_PIN, act_on ? HIGH : LOW);
    } else {
        digitalWrite(ACTIVITY_LED_PIN, LOW);
        act_on = false;
    }
    return;
#else
    uint32_t now = millis();
    bool toggle = (now - g_led_last_toggle) >= LED_BLINK_MS;

    if (!g_can_initialized) {
        if (toggle) { g_led_last_toggle = now; g_led_on = !g_led_on; }
        ledWrite(g_led_on ? 32 : 0, 0, 0);
        return;
    }
#if !defined(NO_WIFI)
    if (!g_ap_running && WiFi.status() != WL_CONNECTED) {
        if (toggle) { g_led_last_toggle = now; g_led_on = !g_led_on; }
        ledWrite(g_led_on ? 24 : 0, g_led_on ? 12 : 0, 0);
        return;
    }
#endif
    bool active = (g_frames_rx > 0) && (now - g_last_frame_ms < LED_ACTIVE_MS);
    if (!active) {
        ledWrite(4, 4, 4);
        g_led_on = false;
        g_led_last_toggle = now;
        return;
    }
    if (toggle) {
        g_led_last_toggle = now;
        g_led_on = !g_led_on;
    }
    ledWrite(0, g_led_on ? 32 : 0, 0);
#endif
}

#if defined(HAS_VIN_SENSE)
// Sample the 12 V input rail every ~500 ms. analogReadMilliVolts() applies
// the ADC's eFuse calibration; we oversample 16× to knock the LSB noise down.
// The divider scales the pin reading back up to the actual VCC.
static void updateVinSense() {
    static uint32_t last_ms = 0;
    uint32_t now = millis();
    if (now - last_ms < 500) return;
    last_ms = now;
    uint32_t sum_mv = 0;
    for (int i = 0; i < 16; i++) sum_mv += analogReadMilliVolts(VIN_SENSE_PIN);
    float pin_mv = sum_mv / 16.0f;
    g_vin_v = (pin_mv * VIN_DIVIDER_NUM / VIN_DIVIDER_DEN) / 1000.0f;
}
#endif

// ── CAN bus-off recovery ──────────────────────────────────────────────────────
// Sustained bus errors (shorted wiring, bitrate mismatch while transmitting)
// drive the TWAI controller bus-off, where it stays until software intervenes
// — without this, capture is dead until a power cycle. Poll the driver state
// and walk it back: BUS_OFF → initiate recovery (the controller waits out
// 128×11 recessive bits), which completes into STOPPED → start again.
//
// The MCP2515 (can1) deliberately has no equivalent: bus-off is driven by the
// *transmit* error counter, so a listen-only controller can never reach it,
// and in a -DCAN_ALLOW_TX build the MCP2515 — unlike the TWAI peripheral —
// recovers from bus-off automatically in hardware. Its error state is
// observable via tec/rec/eflg in the /json mcp2515 block.

static void canRecoveryTick() {
    static uint32_t last_ms = 0;
    uint32_t now = millis();
    if (!g_can_initialized || now - last_ms < 1000) return;
    last_ms = now;
    twai_status_info_t si;
    if (twai_get_status_info(&si) != ESP_OK) return;
    if (si.state == TWAI_STATE_BUS_OFF) {
        if (twai_initiate_recovery() == ESP_OK) g_can_recoveries++;
    } else if (si.state == TWAI_STATE_STOPPED) {
        twai_start();
    }
}

// ── Helpers ───────────────────────────────────────────────────────────────────

static inline uint16_t be16(uint8_t hi, uint8_t lo) {
    return ((uint16_t)hi << 8) | lo;
}

static inline uint16_t le16(uint8_t lo, uint8_t hi) {
    return ((uint16_t)hi << 8) | lo;
}

static bool allZero(const uint8_t* d) {
    for (int i = 0; i < 8; i++) if (d[i]) return false;
    return true;
}

// ── CAN decoder ───────────────────────────────────────────────────────────────

void decodeCAN(uint32_t can_id, const uint8_t* raw, uint8_t len) {
    uint8_t d[8] = {};
    memcpy(d, raw, len < 8 ? len : 8);

    uint8_t  src = can_id & 0xFF;
    uint8_t  pf  = (can_id >> 16) & 0xFF;
    uint8_t  ps  = (can_id >> 8)  & 0xFF;
    uint16_t pgn = ((uint16_t)pf << 8) | (pf >= 0xF0 ? ps : 0);

    // Count any frame from a known source as decoded, before the per-PGN
    // decoders below — they often early-return on all-zero idle frames.
    if (src == SRC_BMS || src == SRC_BMS_CHGR_IF || src == SRC_CHARGER ||
        src == SRC_VEHICLE || src == SRC_MOTOR || src == SRC_DASH)
        g_frames_decoded++;

    if (src == SRC_BMS) {

        if (pgn >= PGN_CELL_FIRST && pgn <= PGN_CELL_LAST) {
            if (allZero(d)) return;
            int base = (pgn - PGN_CELL_FIRST) * 4;
            for (int slot = 0; slot < 4; slot++) {
                int idx = base + slot;
                if (idx >= NUM_CELLS) break;
                uint16_t mv = be16(d[2*slot], d[2*slot+1]);
                if (mv && mv != 0xFFFF)
                    g_cell_v[idx] = mv / 1000.0f;
            }

        } else if (pgn >= PGN_TEMP_FIRST && pgn <= PGN_TEMP_LAST) {
            if (allZero(d)) return;
            int base = (pgn - PGN_TEMP_FIRST) * 8;
            for (int slot = 0; slot < 8; slot++) {
                int idx = base + slot;
                if (idx >= NUM_TEMPS) break;
                if (d[slot] && d[slot] != 0xFF)
                    g_temp_c[idx] = (float)(d[slot] - TEMP_OFFSET_C);
            }

        } else if (pgn == PGN_F100) {
            if (allZero(d)) return;
            uint16_t raw_cur = be16(d[2], d[3]);
            // Sign convention: positive = charging, negative = discharging.
            float amps  = -((int32_t)raw_cur - PACK_CURRENT_BIAS_RAW) * PACK_CURRENT_LSB_A;
            // Pack voltage is one BE-16 field at 0.1 V/bit. The 60-84 V
            // operating window keeps d[0] at 0x02/0x03, which can make it
            // masquerade as a range-selector byte plus 8-bit voltage.
            float volts = be16(d[0], d[1]) * PACK_VOLTAGE_LSB_V;
            g_pack.voltage_v   = volts;
            g_pack.current_raw = raw_cur;
            g_pack.current_a   = amps;
            g_pack.power_w     = volts * amps;
            g_pack.soc_raw     = d[4];
            g_pack.soc_pct     = d[4] * 0.4f - 0.8f;
            if (isnan(g_session_soc_start_pct))
                g_session_soc_start_pct = g_pack.soc_pct;

            // Integrate power into session energy counters
            uint32_t now = millis();
            if (g_session_last_ms != 0) {
                uint32_t dt_ms = now - g_session_last_ms;
                float dt_s = dt_ms / 1000.0f;
                if (dt_s > 0 && dt_s < 5.0f) {   // sanity: skip bus-silent gaps
                    g_session_active_ms += dt_ms;
                    // power_w: positive = charging, negative = discharging
                    float wh = g_pack.power_w * dt_s / 3600.0f;
                    if (wh > 0) g_session_wh_charged += wh;
                    else        g_session_wh_drawn   += -wh;
                }
            }
            g_session_last_ms = now;

