schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
        } else if (pgn == PGN_F102) {
            if (allZero(d)) return;
            uint16_t max_mv = be16(d[0], d[1]);
            uint16_t min_mv = be16(d[2], d[3]);
            if (!max_mv || !min_mv) return;
            g_pack.cell_max_mv             = max_mv;
            g_pack.cell_min_mv             = min_mv;
            g_pack.cell_spread_mv          = max_mv - min_mv;
            g_pack.cell_max_n              = d[4];
            g_pack.cell_min_n              = d[5];
            g_pack.cell_spread_mv_reported = d[7];
            g_pack.v_estimate = 20.0f * (max_mv + min_mv) / 2.0f / 1000.0f;

        } else if (pgn == PGN_F104) {
            if (allZero(d) || d[0] == 0xFF || d[1] == 0xFF) return;
            g_pack.temp_max_c   = (int8_t)(d[0] - TEMP_OFFSET_C);
            g_pack.temp_min_c   = (int8_t)(d[1] - TEMP_OFFSET_C);
            g_pack.temp_max_n   = d[2];
            g_pack.temp_min_n   = d[3];
            g_pack.temp_spread_c = (int8_t)d[4];

        } else if (pgn == PGN_F106) {
            if (allZero(d)) return;
            g_bms_state.byte0 = d[0];
            g_bms_state.byte1 = d[1];
            g_bms_state.valid = true;

        } else if (pgn == PGN_F107) {
            if (allZero(d)) return;
            g_bms_limit.last_seen_ms = millis();
            g_bms_limit.discharge_a = be16(d[0], d[1]) * LIMIT_CURRENT_LSB_A;
            g_bms_limit.charge_a    = be16(d[2], d[3]) * LIMIT_CURRENT_LSB_A;
            g_bms_limit.charge_power_extra_w = be16(d[6], d[7]) * LIMIT_POWER_EXTRA_LSB_W;
            g_bms_limit.mode  = d[4];
            g_bms_limit.byte5 = d[5];
            g_bms_limit.valid = true;

        } else if (pgn == PGN_F108) {
            // F108 is a continuous bitmap broadcast: an all-zero frame means
            // "no faults" and must clear previously latched codes, so there
            // is deliberately no allZero() skip here.
            memcpy(g_bms_faults.bytes, d, 8);
            g_bms_faults.active_codes_mask = 0;
            for (int bi = 0; bi < 7; bi++) {
                for (int bit = 0; bit < 8; bit++) {
                    uint8_t code = FAULT_BYTES_0_TO_6[bi][bit];
                    if (code && ((d[bi] >> bit) & 1))
                        g_bms_faults.active_codes_mask |= (1ULL << (code - 100));
                }
            }
            for (int bit = 0; bit < 8; bit++) {
                uint8_t code = FAULT_BYTE7[bit];
                if (code && ((d[7] >> bit) & 1))
                    g_bms_faults.active_codes_mask |= (1ULL << (code - 100));
            }
            g_bms_faults.any_fault = g_bms_faults.active_codes_mask != 0;
        }

    } else if (src == SRC_VEHICLE && pgn == PGN_F100) {
        g_vc_state = d[0];

    } else if (src == SRC_MOTOR && pgn == PGN_FF21) {
        uint16_t rpm_raw  = le16(d[2], d[3]);
        int      rpm_mag  = (int)rpm_raw - RPM_BIAS;
        // Raw can jitter a bit below the zero-RPM bias at standstill; without
        // the clamp the uint16_t cast below would wrap a small negative to
        // ~65000 RPM (and a garbage speed).
        if (rpm_mag < 0) rpm_mag = 0;
        uint8_t  fnr      = d[7] & 0x0F;
        int8_t   dir      = (fnr == 0x4) ? 1 : (fnr == 0x8) ? -1 : 0;
        g_motor.rpm_magnitude      = (uint16_t)rpm_mag;
        g_motor.rpm_signed         = dir * rpm_mag;
        g_motor.direction          = dir;
        g_motor.range         = ((d[7] >> 4) & 0x0F) + 1;
        g_motor.torque_raw       = le16(d[0], d[1]);
        if (d[4]) g_motor.controller_temp_c = (int8_t)(d[4] - TEMP_OFFSET_C);
        if (d[5]) g_motor.motor_temp_c      = (int8_t)(d[5] - TEMP_OFFSET_C);
        g_motor.valid = true;
        g_motor.last_seen_ms = millis();

    } else if (src == SRC_DASH && pgn == PGN_FF21) {
        g_dash_alive = d[0];

    } else if (src == SRC_MOTOR && pgn == PGN_FECA) {
        uint32_t spn = d[2] | ((uint32_t)d[3] << 8)
                       | (((uint32_t)(d[4] >> 5) & 0x07) << 16);
        uint8_t fmi = d[4] & 0x1F;
        bool active = (spn || fmi);
        if (!d[0] && !d[1] && !active) {
            // Healthy idle — clear any previously latched DTC so the JSON
            // reports "presently inactive", not "last fault ever observed".
            g_dm1 = Dm1State();
            return;
        }
        g_dm1.lamp_byte0 = d[0];
        g_dm1.lamp_byte1 = d[1];
        g_dm1.dtc_spn    = spn;
        g_dm1.dtc_fmi    = fmi;
        g_dm1.dtc_cm     = (d[5] >> 7) & 0x01;
        g_dm1.dtc_oc     = d[5] & 0x7F;
        g_dm1.valid      = true;

    } else if (src == SRC_CHARGER && pgn == PGN_FF50) {
        if (allZero(d)) return;
        // Standard Elcon/TC charger status frame: BE-16 output voltage and
        // BE-16 output current (0.1/bit each), then a fault-flag byte
        // (CHGR_FLAG_*; 0x00 = actively delivering). Voltage reads the
        // charger's own output terminals — it equals pack V only while
        // delivering, so consumers gate any pack-V use on flags == 0.
        g_charger.v_raw     = be16(d[0], d[1]);
        g_charger.i_raw     = be16(d[2], d[3]);
        g_charger.flags     = d[4];
        g_charger.voltage_v = g_charger.v_raw * PACK_VOLTAGE_LSB_V;
        g_charger.current_a = g_charger.i_raw * CHARGER_I_LSB_A;
        g_charger.valid = true;

    } else if (src == SRC_BMS_CHGR_IF && pgn == PGN_PROP_0600) {
        uint16_t v_set = be16(d[0], d[1]);
        uint16_t i_set = be16(d[2], d[3]);
        g_chgr_cmd.enable = d[4];
        if (v_set || i_set) {
            g_chgr_cmd.voltage_v = v_set * 0.1f;
            g_chgr_cmd.current_a = i_set * 0.1f;
            g_chgr_cmd.v_raw     = v_set;
            g_chgr_cmd.i_raw     = i_set;
        } else {
            // Idle frame: V=0, I=0, enable=1 — clear the setpoint so the JSON
            // emits enable only, instead of freezing on the last active values.
            g_chgr_cmd.voltage_v = NAN;
            g_chgr_cmd.current_a = NAN;
            g_chgr_cmd.v_raw     = 0;
            g_chgr_cmd.i_raw     = 0;
        }
        g_chgr_cmd.valid = true;
    }
}

// ── Kelly e-hydraulic pump monitor (opt-in) ─────────────────────────────────────
#if defined(ENABLE_KELLY)
// Read-only serial monitor for the Kelly KLS pump controller on UART1. Ports the
// ETS protocol from kelly/solectrac-kelly-monitor.py: 8N1, three zero-data
// monitor queries 0x3A/0x3B/0x3C, each answered by [CMD,0x10,<16 data>,CHK]; the
// three 16-byte replies concatenate into a 48-byte block. Polling is a
// cooperative state machine so loop() never blocks. See kelly/README.md.

// The Kelly transmits at its documented 19200 baud — fixed, no sweep; CONFIRMED
// by sustained ~99% frame success. An earlier ~19,900 figure (crystal-referenced
// edge timing, -DKELLY_BAUD_MEASURE, below) was measured through a
// doubly-corrupted receive path — an Arduino core 2.0.x firmware bug (fixed by
// the pioarduino/core-3.x platform, see platformio.ini) on top of the noisy
// RXD0 console pad (GPIO44, since moved to GPIO47/48) — and is void. The full
// story is in kelly/README.md §"Actual line rate".
static const uint32_t KELLY_BAUD = 19200;
static const uint8_t  KELLY_MON_CMDS[3]      = {0x3A, 0x3B, 0x3C};
static const uint32_t KELLY_POLL_INTERVAL_MS = 40;     // gap between individual queries
static const uint32_t KELLY_CMD_TIMEOUT_MS   = 600;    // per-command reply wait
                                                       // (matches the Python
                                                       // monitor's 0.6 s; the
                                                       // Kelly's turnaround plus
                                                       // loop latency exceeds a
                                                       // short window)
static const uint32_t KELLY_STALE_MS         = 5000;   // JSON freshness window (a
                                                       // little headroom over the
                                                       // observed worst-case gap)

// Display-only fault names by error_status bit (0..15). Kept in the renderer per
// project convention; the encoding (BE u16 @ block offset 16) is the protocol
// fact. Mirrors ERROR_NAMES in solectrac-kelly-monitor.py.
static const char* const KELLY_ERROR_NAMES[16] = {
    "Identify Err", "Over Volt", "Low Volt", "Reserved",
    "Locking", "V+ Err", "Overtemp", "High Pedel",
    "Reserved", "Reset Error", "Pedel Error", "Hall Sensor Error",
    "Reserved", "Emergency Rev Err", "Motor OverTemp Err", "Current Meter Err",
};

// Read-only transmit chokepoint: only the three zero-data monitor queries are
// ever put on the wire (mirrors READ_ONLY_COMMANDS in the Python monitor). No
// flash session is opened, so the firmware cannot write or reconfigure the
// controller — read-only by construction.
static bool kellyIsMonitorCmd(uint8_t cmd) {
    return cmd == 0x3A || cmd == 0x3B || cmd == 0x3C;
}
static void kellySendQuery(uint8_t cmd) {
    if (!kellyIsMonitorCmd(cmd)) return;          // refuse anything else
    const uint8_t frame[3] = {cmd, 0x00, cmd};    // [CMD, LEN=0, CHK=CMD]
    Serial1.write(frame, sizeof(frame));
}

// Decode the 48-byte block into g_kelly. Offsets and raw (unscaled) semantics
// mirror Monitor.decode; only offsets 0..21 are defined by the protocol.
static void kellyDecodeBlock(const uint8_t* b) {
    g_kelly.tps_pedal         = b[0];
    g_kelly.forward_switch    = b[4];
    g_kelly.b_plus_v          = b[9];
    g_kelly.motor_temp_c      = b[10];   // raw byte, as the Python decode leaves it
    g_kelly.controller_temp_c = b[11];
    g_kelly.low_speed         = b[15];
    g_kelly.error_status      = (uint16_t(b[16]) << 8) | b[17];   // big-endian
    g_kelly.motor_speed_rpm   = (uint16_t(b[18]) << 8) | b[19];
    g_kelly.phase_current_a   = (uint16_t(b[20]) << 8) | b[21];
    g_kelly.valid             = true;
    g_kelly.last_seen_ms      = millis();
}

