schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
    // Per-cell arrays (20 voltages, 7 temperatures; null if not yet received).
    // Emitted in the minimal/BLE payload too so the cell-detail view works over
    // Bluetooth as well as WiFi; costs ~200 B (a couple more BLE chunks).
    {
        auto cells = cells_obj["voltages"].to<JsonArray>();
        for (int i = 0; i < NUM_CELLS; i++) {
            if (!isnan(g_cell_v[i]))
                cells.add(roundf(g_cell_v[i] * 1000.0f) / 1000.0f);
            else
                cells.add(nullptr);
        }
        auto temps = cells_obj["temp_readings"].to<JsonArray>();
        for (int i = 0; i < NUM_TEMPS; i++) {
            if (!isnan(g_temp_c[i]))
                temps.add((int)g_temp_c[i]);
            else
                temps.add(nullptr);
        }
    }

    // BMS state
    if (g_bms_state.valid) {
        // Raw F106 bitmaps; the dashboard decodes the individual bits. Sent
        // in the minimal (BLE) payload too — the dashboard's BMS State panel
        // reads only these two bytes.
        auto st = doc["bms"]["state"].to<JsonObject>();
        st["byte0"] = g_bms_state.byte0;
        st["byte1"] = g_bms_state.byte1;
    }

    // BMS current limits
    if (g_bms_limit.valid) {
        auto lim = doc["bms"]["limit"].to<JsonObject>();
        addFloat(lim, "discharge_a", g_bms_limit.discharge_a, 2);
        addFloat(lim, "charge_a",    g_bms_limit.charge_a,    2);
        addFloat(lim, "charge_power_extra_w", g_bms_limit.charge_power_extra_w, 0);
        if (!minimal) {
            lim["mode"]  = g_bms_limit.mode;
            lim["byte5"] = g_bms_limit.byte5;
        }
    }

    // Combined fault codes (BMS + Motor Controller)
    auto faults = doc["faults"].to<JsonObject>();
    auto bms_codes = faults["bms"].to<JsonArray>();
    if (g_bms_faults.any_fault) {
        for (int code = 100; code <= 145; code++) {
            if (g_bms_faults.active_codes_mask & (1ULL << (code - 100)))
                bms_codes.add(code);
        }
    }
    auto mc_codes = faults["mc"].to<JsonArray>();
    if (g_dm1.valid && g_dm1.dtc_spn != 0)
        mc_codes.add(g_dm1.dtc_spn);

    // Motor — always emit so motor.alive is the canonical tractor-on signal.
    // FF21CA broadcasts at ~85 Hz; the MC stops within ~1s of key-off. The
    // 500 ms window catches brief key cycles without false-positiving on a
    // single dropped frame. last_seen_ms==0 means FF21CA has never been
    // heard in this boot — explicitly false rather than relying on a
    // millis()-rollover-from-zero accident.
    {
        auto mot = doc["motor"].to<JsonObject>();
        mot["alive"] = g_motor.last_seen_ms != 0
                       && (millis() - g_motor.last_seen_ms) < 500;
        if (g_motor.valid) {
            if (!minimal) mot["rpm_signed"] = g_motor.rpm_signed;
            mot["rpm_magnitude"] = g_motor.rpm_magnitude;
            mot["direction"]     = g_motor.direction;
            mot["range"]    = g_motor.range;
            mot["torque_raw"] = g_motor.torque_raw;
            if (g_motor.controller_temp_c != INT8_MIN)
                mot["controller_temp_c"] = g_motor.controller_temp_c;
            if (g_motor.motor_temp_c != INT8_MIN)
                mot["motor_temp_c"] = g_motor.motor_temp_c;
        }
    }

    {
        uint32_t nowms = millis();
        bool mc_alive = g_motor.last_seen_ms != 0
                        && (nowms - g_motor.last_seen_ms) < 500;
        doc["tractor"] = mc_alive ? "on" : "off";
    }

#if defined(HAS_VIN_SENSE)
    if (!isnan(g_vin_v)) {
        doc["vin_v"] = roundf(g_vin_v * 10.0f) / 10.0f;
    }
#endif

    // Charger
    if (g_charger.valid) {
        auto chg = doc["charger"].to<JsonObject>();
        chg["flags"] = g_charger.flags;
        if (!minimal) {
            chg["v_raw"]  = g_charger.v_raw;
            chg["i_raw"]  = g_charger.i_raw;
        }
        addFloat(chg, "voltage_v", g_charger.voltage_v, 2);
        addFloat(chg, "current_a", g_charger.current_a, 1);
    }

    // BMS→charger command
    if (g_chgr_cmd.valid) {
        auto cmd = doc["chgr_cmd"].to<JsonObject>();
        if (!minimal) cmd["enable"] = g_chgr_cmd.enable;
        addFloat(cmd, "voltage_v", g_chgr_cmd.voltage_v, 1);
        addFloat(cmd, "current_a", g_chgr_cmd.current_a, 1);
        if (!minimal && g_chgr_cmd.v_raw) cmd["v_raw"] = g_chgr_cmd.v_raw;
        if (!minimal && g_chgr_cmd.i_raw) cmd["i_raw"] = g_chgr_cmd.i_raw;
    }

#if defined(ENABLE_KELLY)
    // Kelly e-hydraulic pump controller. Emitted only while fresh; when the pump
    // system is unpowered the controller goes silent and the object drops out
    // (the dashboard then hides its card). Key names match dashboard.html.
    if (g_kelly.valid && (millis() - g_kelly.last_seen_ms) < KELLY_STALE_MS) {
        auto k = doc["kelly"].to<JsonObject>();
        k["b_plus_v"]          = g_kelly.b_plus_v;
        k["motor_speed_rpm"]   = g_kelly.motor_speed_rpm;
        k["phase_current_a"]   = g_kelly.phase_current_a;
        k["motor_temp_c"]      = g_kelly.motor_temp_c;
        k["controller_temp_c"] = g_kelly.controller_temp_c;
        k["low_speed"]         = g_kelly.low_speed;
        k["error_status"]      = g_kelly.error_status;
        if (!minimal) {
            k["tps_pedal"]      = g_kelly.tps_pedal;
            k["forward_switch"] = g_kelly.forward_switch;
        }
        auto errs = k["errors"].to<JsonArray>();
        for (int b = 0; b < 16; b++) {
            if (g_kelly.error_status & (1 << b)) errs.add(KELLY_ERROR_NAMES[b]);
        }
    }
#if defined(KELLY_DEBUG)
    // Serial-path diagnostics (build with -DKELLY_DEBUG). polls should climb
    // (board is querying); rx_total > 0 means the Kelly is answering; frames_ok
    // vs frames_bad is the per-attempt success rate; block_gap_max_ms is the
    // worst flicker; last_rx shows raw bytes for framing/baud checks.
    if (!minimal) {
        auto kd = doc["kelly_dbg"].to<JsonObject>();
        kd["polls"]       = g_kelly_polls;
        kd["rx_total"]    = g_kelly_rx_total;
        kd["baud"]        = KELLY_BAUD;
        kd["frames_ok"]   = g_kelly_frames_ok;
        kd["frames_bad"]  = g_kelly_frames_bad;
        kd["blocks_ok"]   = g_kelly_blocks_ok;
        kd["block_gap_max_ms"] = g_kelly_block_gap_max_ms;
        kd["block_gap_ms"]     = g_kelly_last_block_ms ? (millis() - g_kelly_last_block_ms) : 0;
        kd["last_rx_len"] = g_kelly_last_rx_len;
        char hex[65];
        uint8_t n = g_kelly_last_rx_len < 32 ? g_kelly_last_rx_len : 32;
        for (uint8_t i = 0; i < n; i++) sprintf(hex + i * 2, "%02X", g_kelly_last_rx[i]);
        hex[n * 2] = '\0';
        kd["last_rx"] = hex;
    }
#endif  // KELLY_DEBUG
#if defined(KELLY_BAUD_MEASURE)
    // Baud diagnosis (build with -DKELLY_BAUD_MEASURE). "rx" times the RX pin,
    // i.e. the Kelly's real transmit rate; "tx" times the TX pin, i.e. this
    // board's real transmit rate. The register block shows what the UART was
    // programmed to do: sclk should read XTAL (crystal-derived, exact) and
    // calc_baud should land on the nominal — RC_FAST there would mean the
    // divisor runs from the ±several-% RC oscillator instead.
    if (!minimal) {
        auto kb = doc["kelly_baud"].to<JsonObject>();
        kb["nominal"]  = KELLY_BAUD;
        kb["readback"] = Serial1.baudRate();   // core's own divisor-derived value
        uint32_t clk_conf     = UART1.clk_conf.val;
        uint32_t clkdiv_reg   = UART1.clkdiv.val;
        uint32_t sclk_sel     = (clk_conf >> 20) & 0x3;   // TRM: 1=APB 2=RC_FAST 3=XTAL
        uint32_t sclk_div_num = (clk_conf >> 12) & 0xFF;
        uint32_t div_int      = clkdiv_reg & 0xFFF;
        uint32_t div_frag     = (clkdiv_reg >> 20) & 0xF;
        static const char* const KELLY_SCLK_NAMES[4] = {"?", "APB", "RC_FAST", "XTAL"};
        kb["sclk"]         = KELLY_SCLK_NAMES[sclk_sel];
        kb["sclk_div_num"] = sclk_div_num;
        kb["clkdiv_int"]   = div_int;
        kb["clkdiv_frag"]  = div_frag;
        // Rate the divisor produces if the source clock is exactly nominal
        // (APB/XTAL are crystal-derived; RC_FAST is ~17.5 MHz only nominally).
        float sclk_hz = (sclk_sel == 1) ? (float)getApbFrequency()
                      : (sclk_sel == 3) ? getXtalFrequencyMhz() * 1e6f
                      : (sclk_sel == 2) ? 17.5e6f
                                        : 0.0f;
        float div = (sclk_div_num + 1) * (div_int + div_frag / 16.0f);
        if (sclk_hz > 0 && div > 0) addFloat(kb, "calc_baud", sclk_hz / div, 1);
        struct { const char* key; KellyMeasChan* c; KellyMeasResult* r; } chans[] = {
            {"rx", &g_kmeas_rx, &g_kmeas_rx_res},   // Kelly Tx wire -> Kelly's rate
            {"tx", &g_kmeas_tx, &g_kmeas_tx_res},   // our Tx wire   -> this board's rate
        };
        for (auto& ch : chans) {
            auto o = kb[ch.key].to<JsonObject>();
            o["edges_total"] = ch.c->total;
            o["windows"]     = ch.r->windows;
            o["fails"]       = ch.r->fails;
            if (ch.r->pulses) {   // last analyzed window, fit accepted or not
                o["pulses"] = ch.r->pulses;
                o["noise"]  = ch.r->noise;
                addFloat(o, "p25_us", ch.r->p25_us, 1);
                addFloat(o, "p50_us", ch.r->p50_us, 1);
                addFloat(o, "p90_us", ch.r->p90_us, 1);
            }
            if (ch.r->valid) {
                o["used"]    = ch.r->used;
                o["singles"] = ch.r->singles;
                addFloat(o, "bit_us", ch.r->bit_us, 3);
                addFloat(o, "baud",   ch.r->baud,   0);
            }
        }
    }
#endif  // KELLY_BAUD_MEASURE
#endif  // ENABLE_KELLY

    if (!minimal) {
        // Vehicle controller
        if (g_vc_state != 0xFF)
            doc["vc"]["state"] = g_vc_state;

        // Dashboard
        if (g_dash_alive != 0xFF)
            doc["dash"]["alive"] = g_dash_alive;

        // DM1 (raw FMI/OC/CM and lamp bytes — fault code is also in faults.mc)
        if (g_dm1.valid) {
            auto dm1 = doc["dm1"].to<JsonObject>();
            dm1["lamp_byte0"] = g_dm1.lamp_byte0;
            dm1["lamp_byte1"] = g_dm1.lamp_byte1;
            dm1["dtc_spn"]    = g_dm1.dtc_spn;
            dm1["dtc_fmi"]    = g_dm1.dtc_fmi;
            dm1["dtc_cm"]     = g_dm1.dtc_cm;
            dm1["dtc_oc"]     = g_dm1.dtc_oc;
        }
    }

    String out;
    if (pretty) serializeJsonPretty(doc, out);
    else        serializeJson(doc, out);
    return out;
}

